MaJerle/stm32f429/00-STM32F429_LIBRARIES/tm_stm32f4_bkpsram.h
/**
 *	4-kBytes backup ram library for STM32F4xx.
 *
 *	@author 	Tilen Majerle
 *	@email		tilen@majerle.eu
 *	@website	http://stm32f4-discovery.com
 *	@link		http://stm32f4-discovery.com/2014/12/library-45-interface-backup-sram-on-stm32f4
 *	@version 	v1.0
 *	@ide		Keil uVision
 *	@license	GNU GPL v3
 *	
 * |----------------------------------------------------------------------
 * | Copyright (C) Tilen Majerle, 2014
 * | 
 * | This program is free software: you can redistribute it and/or modify
 * | it under the terms of the GNU General Public License as published by
 * | the Free Software Foundation, either version 3 of the License, or
 * | any later version.
 * |  
 * | This program is distributed in the hope that it will be useful,
 * | but WITHOUT ANY WARRANTY; without even the implied warranty of
 * | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * | GNU General Public License for more details.
 * | 
 * | You should have received a copy of the GNU General Public License
 * | along with this program.  If not, see <http://www.gnu.org/licenses/>.
 * |----------------------------------------------------------------------
 *
 *  This library is not supported for STM32F401 and STM32F411,
 *	because they don't have backup SRAM.
 *
 *	If you will try to read from "SRAM memory" on these devices,
 *	you will get a "HardFault" error.
 */
#ifndef TM_BKPSRAM_H
#define TM_BKPSRAM_H 100

/* C++ detection */
#ifdef __cplusplus
extern C {
#endif

/**
 * Library dependencies
 * - STM32F4xx
 * - STM32F4xx RCC
 * - STM32F4xx PWR
 * - defines.h
 */
/**
 * Includes
 */
#include "stm32f4xx.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_pwr.h"
#include "defines.h"

/**
 * Get memory size for internal backup SRAM
 *
 * Returns memory value in Bytes
 */
#define TM_BKPSRAM_GetMemorySize()			(0x00001000)

/**
 * Initialize backup SRAM peripheral
 *
 * This function initializes and enable backup SRAM domain.
 * With this settings you have access to save/get from locations where SRAM is.
 *
 * No return
 */
extern void TM_BKPSRAM_Init(void);

/**
 * Write 8-bit value to backup SRAM at desired location
 *
 * Parameters:
 * 	- uint16_t address:
 * 		Address where to save data in SRAM.
 * 		Value between 0 and TM_BKPSRAM_GetMemorySize() - 1 is valid, if more, HardFault error can happen.
 * - uint8_t value:
 * 		8-bit value which will be stored to backup SRAM
 *
 * No return
 *
 * Defined as macro
 */
#define TM_BKPSRAM_Write8(address, value)	(*(__IO uint8_t *) (BKPSRAM_BASE + (address)) = (value))

/**
 * Read 8-bit value from backup SRAM at desired location
 *
 * Parameters:
 * 	- uint16_t address:
 * 		Address from where read data in SRAM.
 * 		Value between 0 and TM_BKPSRAM_GetMemorySize() - 1 is valid, if more, HardFault error can happen.
 *
 * 8-bit value at specific location is returned
 *
 * Defined as macro
 */
#define TM_BKPSRAM_Read8(address)			(*(__IO uint8_t *) (BKPSRAM_BASE + address))

/**
 * Write 16-bit value to backup SRAM at desired location
 *
 * Parameters:
 * 	- uint16_t address:
 * 		Address where to save data in SRAM.
 * 		Value between 0 and TM_BKPSRAM_GetMemorySize() - 2 is valid, if more, HardFault error can happen.
 * - uint16_t value:
 * 		16-bit value which will be stored to backup SRAM
 *
 * No return
 *
 * Defined as macro
 */
#define TM_BKPSRAM_Write16(address, value)	(*(__IO uint16_t *) (BKPSRAM_BASE + (address)) = (value))

/**
 * Read 16-bit value from backup SRAM at desired location
 *
 * Parameters:
 * 	- uint16_t address:
 * 		Address from where read data in SRAM.
 * 		Value between 0 and TM_BKPSRAM_GetMemorySize() - 2 is valid, if more, HardFault error can happen.
 *
 * 16-bit value at specific location is returned
 *
 * Defined as macro
 */
#define TM_BKPSRAM_Read16(address)			(*(__IO uint16_t *) (BKPSRAM_BASE + address))

/**
 * Write 32-bit value to backup SRAM at desired location
 *
 * Parameters:
 * 	- uint16_t address:
 * 		Address where to save data in SRAM.
 * 		Value between 0 and TM_BKPSRAM_GetMemorySize() - 4 is valid, if more, HardFault error can happen.
 * - uint8_t value:
 * 		32-bit value which will be stored to backup SRAM
 *
 * No return
 *
 * Defined as macro
 */
#define TM_BKPSRAM_Write32(address, value)	(*(__IO uint32_t *) (BKPSRAM_BASE + (address)) = (value))

/**
 * Read 32-bit value from backup SRAM at desired location
 *
 * Parameters:
 * 	- uint16_t address:
 * 		Address from where read data in SRAM.
 * 		Value between 0 and TM_BKPSRAM_GetMemorySize() - 4 is valid, if more, HardFault error can happen.
 *
 * 32-bit value at specific location is returned
 *
 * Defined as macro
 */
#define TM_BKPSRAM_Read32(address)			(*(__IO uint32_t *) (BKPSRAM_BASE + address))

/* C++ detection */
#ifdef __cplusplus
}
#endif

#endif
